---
kind: property
id: P:Autodesk.Revit.DB.FabricationAncillaryUsage.UsageType
source: html/599406b0-c2c9-1927-b975-4f2ef65bd8b3.htm
---
# Autodesk.Revit.DB.FabricationAncillaryUsage.UsageType Property

Fabrication ancillary usage type.

## Syntax (C#)
```csharp
public FabricationAncillaryUsageType UsageType { get; }
```